Revit 2027 API
PointCloudColorSettings(Color, Color) Constructor
 Constructs color settings object from given colors.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointCloudColorSettings(
	Color color1,
	Color color2
)
Public Sub New (
	color1 As Color,
	color2 As Color
)
public:
PointCloudColorSettings(
	Color^ color1,
	Color^ color2
)
new :
        color1 : Color *
        color2 : Color -> PointCloudColorSettings
Parameters
color1 Color
color2 Color
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointCloudColorSettings Class
PointCloudColorSettings Overload
Autodesk.Revit.DB.PointClouds Namespace